docs(lib-network-protocol): use mermaid diagram on routing readme.md
